{
    "NewChanges":{
        "Changes": [
            {
                "title": "Change Log",
                "text": "Brief rundown of how the bot stores characters, and the newest commands"
            },
            {
                "title": "New Commands",
                "text": "allcharacters, deletecharacter, whatsintheworks, payyaboi, deleteplayer"
            },
            {
                "title": "New Automations",
                "text": "New Member Welcome Message"
            },
            {
                "title": "AllCharacters",
                "text": "Displays a complete list of all of the characters. This is something to be reworked in the future when/if the amount of characters becomes a list too long to post through discord."
            },
            {
                "title": "DeleteCharacter",
                "text": "Does what you'd think it would do. If there is only one character, it's yeeted. If there is more than one, it'll ask for some verifications."
            },
            {
                "title": "WhatsInTheWorks",
                "text": "This feature will display all of the things that I've listed that I'm actively working on, or things that have been discussed and are in the queue of things to do."
            },
            {
                "title": "PayYaBoi",
                "text": "This will post a link for anyone to access a way to pay the dev of this bot."
            },
            {
                "title": "DeletePlayer",
                "text": "This command will delete all the characters for a player, and the provided player from the database. This will be the groundwork for the automated deletion upon player leaving server"
            },
            {
                "title": "NewMember",
                "text": "Will tag new members in the welcome channel, and provide the new user with introductionary help fow what they need to do."
            },
            {
                "title": "Approval",
                "text": "Fixed error with pdf files not saving"
            }
        ],
        "footer": [
            "I'll try to post one of these every time a new major feature is out, or when there is a major change to an existing. As always, you can type !help to get a list of commands, and !help <commandname> to get more specific information on a command"
        ]
    }
}