{
    "NewChanges":{
        "Changes": [
            {
                "title": "Change Log v. 1.0.1",
                "text": "Brief rundown of how the bot stores characters"
            },
            {
                "title": "Change List",
                "text": " Bot has 4 entries to teh database: UserName, UserID, CharacterName, and CharacterSheet"
            },
            {
                "title": "UserName",
                "text": "The current name of the user. Not their nickname, but their Discord name. I plan to make a change in the future to update this entry should someone change their name. The bot gathers this based on who **posted** the post that you react to"
            },
            {
                "title": "UserID",
                "text": "This is the unique identifier of who is who. This ID can never be changed. This is also gathered based on who posted the message that you react to."
            },
            {
                "title": "CharcterName",
                "text": "This is found by you answering the question it asks. When doing this, try to avoid special characters as we can't all type those as easily. I.E. É is not so easy for American keyboards to find. You can now have character names of longer than one word. Will likely break if you put in commas or periods."
            },
            {
                "title": "CharacterSheet",
                "text": "This is gathered by the message that you react to. If this is a .pdf file, it will store the pdf on the remote host for later use. If this isn't, because some asshat doesn't/won't/can't make a pdf, this will instead store whatever link they provide. This likely will only really work when the entirety of the message is the link, and I am aware of this bug."
            },
            {
                "title": "New Commands",
                "text": "allcharacters, deletecharacter, whatsintheworks, payyaboi"
            },
            {
                "title": "AllCharacters",
                "text": "Displays a complete list of all of the characters. This is something to be reworked in the future when/if the amount of characters becomes a list too long to post through discord."
            },
            {
                "title": "DeleteCharacter",
                "text": "Does what you'd think it would do. If there is only one character, it's yeeted. If there is more than one, it'll ask for some verifications."
            },
            {
                "title": "WhatsInTheWorks",
                "text": "This feature will display all of the things that I've listed that I'm actively working on, or things that have been discussed and are in the queue of things to do."
            },
            {
                "title": "PayYaBoi",
                "text": "This will post a link for anyone to access a way to pay the dev of this bot."
            }
        ],
        "footer": [
            "I'll try to post one of these every time a new major feature is out, or when there is a major change to an existing. As always, you can type !help to get a list of commands, and !help <commandname> to get more specific information on a command"
        ]
    }
}